<template>
  <div>
    <div class="terms">
      <div class="container">
        <div class="_title"></div>
        <div class="terms_block">
          <div class="terms_block_menu">
            <div class="terms_block_menu_item " :class="term==1?'active':''" @click="term=1">
              Пользовательское соглашение
            </div>
            <div class="terms_block_menu_item" :class="term==2?'active':''" @click="term=2">
              Условия для преподавателей
            </div>
            <div class="terms_block_menu_item" :class="term==3?'active':''" @click="term=3">
              Безопасность онлайн платежей
            </div>
            <div class="terms_block_menu_item" :class="term==4?'active':''" @click="term=4">
              Политика конфиденциальности
            </div>
<!--            <div class="terms_block_menu_item" :class="term==5?'active':''" @click="term=5">-->
<!--              Политика защиты интеллектуальной собственности-->
<!--            </div>-->

          </div>
          <div class="terms_block_content" v-if="term==1">
            <h5><strong>Пользовательское соглашение</strong></h5>
            <p>Oilama.com &ndash; образовательный маркетплейс (Далее - Платформа), предоставляющий доступ к
              образовательным материалам (Далее - Курсы) в самых разных сферах. Авторы курсов могут размещать свои
              платные, либо бесплатные курсы, определять стоимость, редактировать и дополнять. Ученики в свою очередь,
              приобретают Курсы, проходят обучение и получают сертификат.&nbsp;</p>
            <br>
            <p>В целях обеспечения прозрачной работы , а также безопасности всех сторон сотрудничества в рамках нашей
              платформы, мы разработали данное Пользовательское соглашение (Далее - Соглашение). Здесь мы подробно
              пропишем правила и условия использования Платформы, как работает экосистема Oilama.</p>
            <br>
            <p>Данное Соглашение работает совместно с другими нормативными актами: Условия для преподавателей,
              Безопасность онлайн платежей, Политика конфиденциальности&nbsp; и Политика защиты интеллектуальной
              собственности. Все эти документы находятся в открытом доступе на сайте Oilama.com</p>
            <br>
            <p>Для получения пользы от нашей платформы, необходимо зарегистрировать учетную запись. Вы должны понимать,
              что несете ответственность за все действия, связанные с Вашей учетной записью. Вы должны понимать, что
              оскорбление личности даже в онлайн среде карается по закону в большинстве стран мира, также Вы должны
              достигать допустимого для использования онлайн-сервисов возраста, который регламентирован в Вашей
              стране.</p>
            <br>
            <p>В случае, если Вы заметили активность, которую Вы не совершали, либо Вы подозревает что кто-то использует
              Вашу учетную запись, сообщите нам об этом написав в Службу поддержки, либо на почту <a
                href="mailto:manager@oilama.com"
              >manager@oilama.com</a></p>
            <br>
            <p>Для предотвращения таких событий, советуем Вам бережно относиться с Вашим паролем.</p>
            <br>
            <p>Если Вы свяжетесь с нами, чтобы запросить доступ к учетной записи, мы предоставим вам такой доступ,
              только если Вы предоставите нам информацию, необходимую для подтверждения права Вашего владения учетной
              записью. В случае смерти пользователя его учетная запись будет закрыта.</p>
            <br>
            <p>Вы не можете предоставлять доступ к Вашей учетной записи третьим лицам. Если мы заметим, что Вы нарушаете
              какое-либо из правил настоящего Соглашения, мы будем вынуждены удалить Вашу учетную запись.</p>
            <br>
            <p>При приобретении Курса, если срок прохождения курса не указан преподавателем на странице курса, Вы
              получаете право на просмотр и обучение с пожизненным доступом, без права записи материалов, продажи или
              передачи учетной записи, за исключением случаев, когда мы вынуждены удалить материалы.</p>
            <br>
            <p>В случае, если приобретенный Вами курс пропал из списка доступных к обучению курсов в Вашей учетной
              записи, Вы можете обратиться в Службу поддержки.</p>
            <br>
            <p>В случае, если приобретенный Вами курс не соответствует заявленному описанию, либо по другой
              мотивированной причине, Вы можете отказаться от прохождения курса в течении 14 дней с момента
              приобретения, при условии что Вы прошли не более половины недель (уроков). Возврат средств может занимать
              до 3-х месяцев с момента подачи заявки на возврат. Для этого Вам нужно написать в Службу поддержки, либо
              на почту <a href="mailto:manager@oilama.com">manager@oilama.com</a></p>
            <br>
            <p>На нашей платформе оплата производится за покупку Сертификата о прохождении Курса. Цена может изменяться
              в зависимости от различных факторов. Также на нашей платформе проводятся акции, скидки и другие действия,
              влияющие на цены. Цена на платформе может отличаться от цены, которую Вы увидели в сторонних ресурсах,
              рекламирующих Курс.</p>
            <br>
            <p>В некоторых случаях, команда нашей платформы привлекает третьих лиц для оказания услуг. Также мы имеем
              право размещать информацию, находящуюся на нашей платформе на сторонних ресурсах, в целях рекламы или
              продвижения. Все эти действия осуществляются исключительно в целях всеобщей выгоды.</p>
            <br>
            <p>Мы оставляем за собой право отказать в регистрации на нашей платформе в одностороннем порядке, без
              разъяснения причин.</p>
            <br>
            <p>В случае, если Вы осуществите любое из указанных ниже действий, будет означать что Вы принимаете
              настоящее Соглашение и обязуетесь выполнять все правила:</p>
            <br>
            <p>&ndash; осуществление доступа к размещенным на Сайте Oilama.com (Далее - Сайт) информации и материалам,
              независимо от продолжительности такого доступа и количества просмотренных страниц Сайта;</p>
            <br>
            <p>&ndash; регистрация на Сайте;</p>
            <br>
            <p>&ndash; оплата материалов Сайта, предоставляемых на возмездной основе;</p>
            <br>
            <p>&ndash; иные действия по использованию сервисов Сайта.</p>
            <br>
            <p>Данное Соглашение написано на русском языке, в случае перевода на другие языки, во всех случаях, с точки
              зрения закона, либо в суде будет рассматриваться вариант Соглашения на русском языке. Мы оставляем за
              собой право вносить поправки, изменения в Соглашение в одностороннем порядке, с указанием даты последней
              редакции и измененных пунктов.</p>
            <br>

          </div>
          <div class="terms_block_content" v-if="term==2">
            <h5><strong>Условия для преподавателей</strong></h5>

            <p>Данный документ&nbsp; регламентирует и разъясняет правила сотрудничества между Администратором платформы
              Oilama.com (далее - Администратор) и лицами, публикующими образовательные материалы (далее -
              Преподаватель), вместе именуемые Стороны.</p>

            <p>Oilama.com &ndash; образовательный маркетплейс (далее - Платформа), предоставляющий доступ к
              образовательным материалам (далее - Курс) в самых разных сферах. Авторы курсов могут регистрироваться в
              качестве преподавателя, размещать свои платные, либо бесплатные курсы, определять стоимость, редактировать
              и дополнять, в целях предоставления услуг по предоставлению Курсов (далее - Услуга).</p>

            <p>В тот момент, когда Вы совершаете какое-либо из перечисленных выше действий, Вы соглашаетесь соблюдать
              настоящие Условия для преподавателей (далее - Условия) и не можете ссылаться на отсутствие подписи, как
              доказательство того, что Условия не были прочитаны/поняты/приняты, поэтому рекомендуем вам внимательно
              прочитать Условия и другие нормативные акты.</p>

            <p>Данные Условия работают совместно с другими нормативными актами: Пользовательское соглашение,
              Безопасность онлайн платежей, Политика конфиденциальности&nbsp; и Политика защиты интеллектуальной
              собственности. Все эти документы находятся в открытом доступе на сайте Oilama.com</p>

            <p>&nbsp;</p>

            <p><strong>1. Права и обязанности преподавателя</strong></p>

            <p>Мы всегда рады конструктивной критике, поэтому вы имеете право в любой момент обратиться к Администратору
              с комментарием, отзывом, советом, предложением (далее - Обращение). Разумеется, вы также имеете право в
              любой момент обратиться к Администратору с вопросом. Мы обещаем, что ответим на вопрос на столько быстро и
              развернуто, насколько это будет возможно; также мы обещаем относиться с максимальной серьезностью к вашим
              обращениям. Обращения и вопросы вы можете отправлять через Службу поддержки в Кабинете преподавателя, либо
              на электронную почту <a href="mailto:manager@oilama.com">manager@oilama.com</a></p>

            <p>Вы имеете полное право устанавливать цены на ваши Курсы, но если цена на другом ресурсе ниже
              устанавливаемой на Платформе, вы должны заранее уведомить об этом нас и объяснить причину.</p>

            <p>Вы всегда можете наблюдать за ходом реализации ваших Курсов в вашем аккаунте на сайте для преподавателей
              (далее &ndash; Кабинет преподавателя), где вам доступна вся необходимая информация.</p>

            <p>Если вы зарегистрировались на Платформе в качестве Преподавателя, это означает что вы несете
              ответственность за все материалы, которые Вы размещаете, включая текстовую информацию, видео-материалы,
              фото-материалы, файлы любых форматов, комментарии написанные с аккаунта преподавателя, информацию о
              преподавателе, тестовые материалы (далее &ndash; Предоставляемые материалы).</p>

            <p>Вы должны понимать, что регистрируясь и публикуя материалы на Oilama.com, вы гарантируете что:</p>

            <ul>
              <li>Не будете размещать материалы, которые содержат незаконную информацию или пропагандируют незаконную
                деятельность, в том числе материалы, возбуждающие социальную, расовую, национальную или религиозную
                ненависть и вражду, пропаганду социального, расового, национального, религиозного или языкового
                превосходства
              </li>
              <li>Не будете размещать материалы, сообщения и комментарии, которые содержат нецензурную лексику,
                оскорбляют честь и достоинство пользователей платформы (далее - Пользователь) и (или) любых третьих лиц
              </li>
              <li>Не будете размещать материалы, сообщения и комментарии, которые содержат угрозы причинения смерти,
                телесных повреждений или повреждения имущества, призывают к нанесению ущерба или поощряют его
              </li>
              <li>Не будете размещать материалы, которые нарушают интеллектуальные и (или) иные права Платформы или
                третьих лиц, в том числе, если права на Онлайн-курсы в необходимом для исполнения настоящих Условий
                объеме у Вас отсутствуют, имеются разногласия (спор) в отношении интеллектуальных прав на Онлайн-курсы и
                т.д.
              </li>
              <li>Не будете размещать информацию, файлы, которые содержат ссылки на вредоносное программное
                обеспечение
              </li>
              <li>Не будете публиковать или передавать нежелательную и несанкционированную рекламу, рекламные материалы,
                нежелательную почту, спам или любые другие формы навязывания услуг (коммерческих и иных) какому-либо
                пользователю или посредством Услуг
              </li>
              <li>Не будете использовать Услуги для любой деятельности, кроме оказания услуг обучения и преподавания
                студентам
              </li>
              <li>Не будете выдавать себя за другое лицо или получать несанкционированный доступ к учетной записи
                другого лица
              </li>
              <li>Не будете мешать или иным образом противодействовать другим преподавателям в предоставлении их услуг
                или материалов
              </li>
              <li>Не будете размещать материалы, которые иным образом нарушают Условия и (или) действующее
                законодательство Республики Казахстан, страны резидентом которой Вы являетесь и страны на территории
                которой Вы находитесь во время размещения Курсов
              </li>
              <li>Вы будете обеспечивать качество услуг, которое соответствует стандартам Вашей отрасли, специализации
                или области знания и услуг обучения в целом
              </li>
              <li>Вы будете поддерживать сведения учетной записи в актуальном состоянии</li>
              <li>Воздержитесь от попыток доступа к Платформе способами, не предусмотренными Условиями, не осуществлять
                какую-либо деятельность, угрожающую нарушением функциональности, целостности или работоспособности
                Платформы
              </li>
            </ul>

            <p>Вы должны понимать, что не можете в любой момент удалить или редактировать проданные либо предоставленные
              образовательные материалы, ведь если ученик купил курс, он получает Пожизненное право на прохождение этого
              курса (только на странице Платформы). Также нужно учесть, что удаление Предоставляемых материалов возможно
              по решению суда, либо других непреодолимых обстоятельств.</p>

            <p>&nbsp;</p>

            <p><strong>2. Права и обязанности Администратора</strong></p>

            <p>Со своей стороны мы обязуемся своевременно устранять технические неполадки на Платформе; вовремя
              реагировать на ваши обращения и вопросы; предоставить вам доступ к Кабинету преподавателя.</p>

            <p>Одна из наших основных целей &ndash; это улучшение и развитие Платформы, поэтому мы обещаем развиваться и
              добавлять новые функции. Как Администратор мы имеем право менять структуру Платформы, дизайн и прочие
              компоненты, без уведомления об этом вас, исключительно в целях развития. Мы просим вас с пониманием
              относиться к моментам, когда мы вынуждены временно приостановить работу Платформы по техническим или иным
              причинам, в том числе вследствие форс-мажорных обстоятельств, препятствующим оказанию Услуг, на время
              устранения таких причин.</p>

            <p>Исключительно в целях развития Платформы, продажи и продвижения Ваших образовательных материалов, при
              регистрации вы предоставляете нам права изменять Предоставляемые материалы для обеспечения их доступности,
              дорабатывать и редактировать их, рекламировать любыми доступными и законными способами. В целях&nbsp;
              продвижения Курсов вы также даете Платформе право передавать Предоставляемые материалы третьим сторонам,
              включая передачу студентам напрямую или с помощью третьих сторон, в том числе с участием реселлеров,
              дистрибьюторов, аффилированных сайтов, сайтов специальных приложений и службы платной рекламы на сторонних
              платформах, с условием уведомления Вас об этом.</p>

            <p>Мы оставляем за собой право удалять материалы, приостанавливать выплаты и/или блокировать преподавателей
              по любой причине в любое время без предварительного уведомления, в том числе в случаях, когда:</p>

            <ul>
              <li>преподаватель или материал не отвечают правилам указанным в документах расположенных на нашем сайте
              </li>
              <li>качество материалов не соответствует нормам и стандартам Платформы</li>
              <li>вы не в полной мере выполнили рекомендации к публикации материалов</li>
              <li>по личным причинам Администрации Платформы, без разъяснения причин</li>
            </ul>

            <p>Также мы имеем право размещать на Платформе рекламу и иную информацию третьих лиц.</p>

            <p>&nbsp;</p>

            <p><strong>3. Платежи и выплаты</strong></p>

            <p>При регистрации в качестве преподавателя на Oilama, мы предложим вам выбрать тариф, либо вид комиссии на
              которой мы будем с вами работать. Ваш выбор будет подтвержден письмом на электронную почту <a
                href="mailto:manager@oilama.com"
              >manager@oilama.com</a>, и будет действовать до окончания срока оплаченного тарифа, либо до заключения
              новых договоренностей.</p>

            <p>Мы готовы забирать на себя все основные затраты, но если в вашей стране существуют дополнительные налоги,
              сборы и прочие дополнительные затраты, мы вынуждены вычесть их из суммы оплаты учениками стоимости
              курса.</p>

            <p>Согласно пользовательскому соглашению, ученики могут осуществить возврат средств в течении 14 дней после
              оплаты, в случае если курс не соответствует описанию. Если поступает такой запрос, мы проверяем
              соответствие описания и материалов курса. В случае, если мы одобряем заявку, все затраты на транзакции
              несет преподаватель, который разместил данный курс.</p>

            <p>Также вы должны понимать, что при оплате от учеников, а также при перечислении денег вам, в зависимости
              от страны, существует разница и потери связанные с конвертацией. Oilama не несет ответственности за
              комиссионные сборы за обмен иностранной валюты, комиссию за банковские переводы, а также любые другие
              сборы за обработку. В Вашем отчете о доходах будет указана цена продаж (в местной валюте) и
              конвертированная сумма вашего дохода (в долларах США).</p>

            <p>В отчете о доходах вы будете получать информацию о сумме покупок, из которых уже вычтены затраты на
              возвраты, комиссии, сборы, и прочие расходы. После получения и согласование отчета, вы отправляете Акт
              выполненных работ на согласованную сумму, при согласии с Актом выполненных работ мы перечисляем вам вашу
              долю в течении 30 дней, по полученным от вас реквизитам.</p>

            <p>&nbsp;</p>

            <p><strong>4. Ответственность </strong></p>

            <p>Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств в
              соответствии с действующим законодательством Республики Казахстан.</p>

            <p>Администратор платформы не несет ответственности за:</p>

            <p>За невозможность использования Преподавателем функциональности Сервиса в случаях несоблюдения требований,
              предусмотренных Условием для преподавателей, Пользовательским соглашением.</p>

            <p>За действия третьих лиц, направленных на нарушение информационной безопасности или нормального
              функционирования Сервиса, включая DDOS-атаки на Сервис, а также сбои в работе Сервиса, вызванные любыми
              вредоносными программами.</p>

            <p>За какие-либо прямые или косвенные убытки, которые Преподаватель/ Пользователи могут понести в результате
              неисполнения или ненадлежащего исполнения Преподавателем настоящих Условий.</p>

            <p>Администратор не гарантирует то, что использование Сервиса будет доступно в любое удобное Преподавателю/
              Пользователям время, будет безопасным, не будет подвержено ошибкам или сбоям. Все дефекты в работе
              программного обеспечения, используемого для целей выполнения условий настоящего договора, будут
              исправляться по мере их обнаружения.</p>

            <p>&nbsp;</p>

            <p><strong>5. Реклама и иная информация на платформе</strong></p>

            <p>Администратор оставляет за собой право размещать в Сервисе рекламу и иную информацию третьих лиц, не
              противоречащую настоящим Условиям и другим нормативным актам платформы.</p>

            <p>Администратор вправе, но не обязан осуществлять проверку информации, размещаемой Заказчиком в Сервисе. В
              случае обнаружения несоответствия данной информации настоящим Условиям и другим нормативным актам
              платформы, Администратор имеет право блокировать, изменять и удалять данную информацию как в полном
              объеме, так и частично.</p>

            <p>&nbsp;</p>

            <p><strong>6. Обстоятельства непреодолимой силы</strong></p>

            <p>Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по Условиям,
              если это неисполнение явилось следствием обстоятельств непреодолимой силы, возникших после заключения
              Условий, в результате обстоятельств чрезвычайного характера, которые Стороны не могли предвидеть или
              предотвратить.</p>

            <p>При наступлении обстоятельств непреодолимой силы каждая Сторона должна в течение 24 (двадцати четырех)
              часов известить о них в письменном виде другую Сторону. Извещение должно содержать данные о характере
              обстоятельств, а также официальные документы, удостоверяющие наличие этих обстоятельств и, по возможности,
              дающие оценку их влияния на возможность исполнения Стороной своих обязательств по данным Условиям.</p>

            <p>В случае наступления обстоятельств непреодолимой силы срок выполнения Стороной обязательств по Условиям
              отодвигается соразмерно времени, в течение которого действуют эти обстоятельства и их последствия.</p>

            <p>Если обстоятельства непреодолимой силы и их последствия продолжают действовать более двух месяцев,
              Стороны проводят дополнительные переговоры для выявления приемлемых альтернативных способов исполнения
              Условий.</p>

          </div>
          <div class="terms_block_content" v-if="term==3">
            <h5><strong>Безопасность онлайн платежей</strong></h5>
            <p>
              <strong>Платежи. Оплата банковской картой онлайн</strong><br/>
              Наш сайт подключен к интернет-эквайрингу, и Вы можете оплатить Услугу банковской картой Visa или
              Mastercard. После подтверждения выбранного Товара либо услуги откроется защищенное окно с платежной
              страницей процессингового центра CloudPayments, где Вам необходимо ввести данные Вашей банковской карты.
              Для дополнительной аутентификации держателя карты используется протокол 3-D Secure. Если Ваш Банк-эмитент
              поддерживает данную технологию, Вы будете перенаправлены на его сервер для прохождения дополнительной
              идентификации. Информацию о правилах и методах дополнительной идентификации уточняйте в Банке, выдавшем
              Вам банковскую карту.<br/>
              <br/>
              Услуга онлайн-оплаты осуществляется в соответствии с правилами Международных платежных систем Visa и
              MasterCard на принципах соблюдения конфиденциальности и безопасности совершения платежа, для этого
              используются самые актуальные методы проверки, шифрования и передачи данных по закрытым каналам связи.
              Ввод данных банковской карты осуществляется в защищенном окне на платежной странице CloudPayments.<br/>
              <br/>
              В поля на платежной странице требуется ввести номер карты, имя владельца карты, срок действия карты,
              трёхзначный код безопасности (CVV2 для VISA или CVC2 для MasterCard). Все необходимые данные отображены на
              поверхности банковской карты.<br/>
              <br/>
              CVV2/ CVC2 &mdash; это трёхзначный код безопасности, находящийся на оборотной стороне карты.<br/>
              <br/>
              Далее в том же окне откроется страница Вашего банка-эмитента для ввода 3-D Secure кода. В случае, если у
              вас не настроен статичный 3-D Secure, он будет отправлен на ваш номер телефона посредством SMS. Если 3-D
              Secure код к Вам не пришел, то следует обратится в ваш банк-эмитент.<br/>
              <br/>
              3-D Secure &mdash; это самая современная технология обеспечения безопасности платежей по картам в сети
              интернет. Позволяет однозначно идентифицировать подлинность держателя карты, осуществляющего операцию, и
              максимально снизить риск мошеннических операций по карте.<br/>
              <br/>
              <strong>Гарантии безопасности</strong><br/>
              Процессинговый центр CloudPayments защищает и обрабатывает данные Вашей банковской карты по стандарту
              безопасности PCI DSS 3.0. Передача информации в платежный шлюз происходит с применением технологии
              шифрования SSL. Дальнейшая передача информации происходит по закрытым банковским сетям, имеющим наивысший
              уровень надежности. CloudPayments не передает данные Вашей карты нам и иным третьим лицам. Для
              дополнительной аутентификации держателя карты используется протокол 3-D Secure.<br/>
              <br/>
              В случае, если у Вас есть вопросы по совершенному платежу, Вы можете обратиться в службу поддержки
              клиентов платежного сервиса по электронной почте&nbsp;<strong>support@cloudpayments.kz</strong>.<br/>
              <br/>
              <strong>Безопасность онлайн-платежей</strong><br/>
              Предоставляемая Вами персональная информация (имя, адрес, телефон, e-mail, номер кредитной карты) является
              конфиденциальной и не подлежит разглашению. Данные Вашей кредитной карты передаются только в зашифрованном
              виде и не сохраняются на нашем Web-сервере.<br/>
              <br/>
              Безопасность обработки Интернет-платежей гарантирует ТОО &laquo;CloudPayments Kazakhstan&raquo;. Все
              операции с платежными картами происходят в соответствии с требованиями VISA International, MasterCard и
              других платежных систем. При передаче информации используются специализированные технологии безопасности
              карточных онлайн-платежей, обработка данных ведется на безопасном высокотехнологичном сервере
              процессинговой компании.<br/>
              <br/>
              Оплата платежными картами безопасна, потому что:<br/>
              <br/>
            </p>
            <ul>
              <li>Система авторизации гарантирует покупателю, что платежные реквизиты его платежной карты (номер, срок
                действия, CVV2/CVC2) не попадут в руки мошенников, так как эти данные не хранятся на сервере авторизации
                и не могут быть похищены.
              </li>
              <li>Покупатель вводит свои платежные данные непосредственно в системе авторизации CloudPayments, а не на
                сайте интернет-магазина, следовательно, платежные реквизиты карточки покупателя не будут доступны
                третьим лицам.
              </li>
            </ul>

            <p>&nbsp;</p>

            <p><strong>Конфиденциальность</strong><br/>
              <br/>
              1. Определения<br/>
              Интернет проект&nbsp;https://oilama.com<a href="https://davidgarrett.kz/"><strong>&nbsp;</strong></a>(далее
              &ndash; URL, &laquo;мы&raquo;) серьезно относится к вопросу конфиденциальности информации своих клиентов и
              посетителей сайта&nbsp;https://oilama.com&nbsp;(далее &ndash; &laquo;вы&raquo;, &laquo;посетители сайта&raquo;).
              Персонифицированной мы называем информацию, содержащую персональные данные (например: ФИО, логин или
              название компании) посетителя сайта, а также информацию о действиях, совершаемых вами на сайте URL.
              (например: заказ посетителя сайта с его контактной информацией). Анонимными мы называем данные, которые
              невозможно однозначно идентифицировать с конкретным посетителем сайта (например: статистика посещаемости
              сайта).<br/>
              <br/>
              2. Использование информации<br/>
              Мы используем персонифицированную информацию конкретного посетителя сайта исключительно для обеспечения
              ему качественного оказания услуг и их учета. Мы не раскрываем персонифицированных данных одних посетителей
              сайта URL другим посетителям сайта. Мы никогда не публикуем персонифицированную информацию в открытом
              доступе и не передаем ее третьим лицам. Исключением являются лишь ситуации, когда предоставление такой
              информации уполномоченным государственным органам предписано действующим законодательством Республики
              Казахстан. Мы публикуем и распространяем только отчеты, построенные на основании собранных анонимных
              данных. При этом отчеты не содержат информацию, по которой было бы возможным идентифицировать
              персонифицированные данные пользователей услуг. Мы также используем анонимные данные для внутреннего
              анализа, целью которого является развитие продуктов и услуг URL<br/>
              <br/>
              3. Ссылки<br/>
              Сайт&nbsp;https://oilama.com&nbsp;может содержать ссылки на другие сайты, не имеющие отношения к нашей
              компании и принадлежащие третьим лицам. Мы не несем ответственности за точность, полноту и достоверность
              сведений, размещенных на сайтах третьих лиц, и не берем на себя никаких обязательств по сохранению
              конфиденциальности информации, оставленной вами на таких сайтах.<br/>
              <br/>
              4. Ограничение ответственности<br/>
              Мы делаем все возможное для соблюдения настоящей политики конфиденциальности, однако, мы не можем
              гарантировать сохранность информации в случае воздействия факторов находящихся вне нашего влияния,
              результатом действия которых станет раскрытие информации. Сайт&nbsp;https://oilama.com&nbsp;и вся
              размещенная на нем информация представлены по принципу &quot;как есть&quot; без каких-либо гарантий. Мы не
              несем ответственности за неблагоприятные последствия, а также за любые убытки, причиненные вследствие
              ограничения доступа к сайту URL или вследствие посещения сайта и использования размещенной на нем
              информации.<br/>
              <br/>
              5. Контакты<br/>
              По вопросам, касающимся настоящей политики, просьба обращаться по
              адресу&nbsp;<strong>info</strong><strong>@</strong><strong>oilama</strong><strong>.com</strong><br/>
              <br/>
              <strong>Юридическое лицо</strong><br/>
              &quot;PayDay Service&quot; LLC<br/>
              БИН: 200240010312<br/>
              010000, г. Нур-Султан<br/>
              Улы-Дала 27/1</p>

          </div>
          <div class="terms_block_content" v-if="term==4">
            <h5>Политика конфиденциальности</h5>
            <p>Политика в отношении обработки и защиты персональных данных</p>

            <p>1. Общие положения</p>

            <p>1.1. Настоящая политика обработки персональных данных составлена с целью соблюдения и защиты прав и
              свобод каждого человека и, в особенности, права на неприкосновенность частной жизни, личную и семейную
              тайну, защиту своей чести и доброго имени.</p>

            <p>1.2. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и
              свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на
              неприкосновенность частной жизни, личную и семейную тайну.</p>

            <p>1.3. Настоящая политика Оператора в отношении обработки персональных данных (далее &ndash; Политика)
              применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта
              https://oilama.com.</p>

            <p>1.4. Данный документ направлен на доведение до сведения субъектов персональных данных позиции и намерения
              Оператора в области обработки и защиты персональных данных.</p>

            <p>1.5. Целями Политики являются определение обработки и обеспечения безопасности персональных данных.</p>

            <p>1.6. Политика является общедоступным документом.</p>

            <p>&nbsp;</p>

            <p>2. Основные понятия, используемые в Политике</p>

            <p>2.1. Автоматизированная обработка персональных данных &ndash; обработка персональных данных с помощью
              средств вычислительной техники;</p>

            <p>2.2. Блокирование персональных данных &ndash; временное прекращение обработки персональных данных (за
              исключением случаев, если обработка необходима для уточнения персональных данных);</p>

            <p>2.3. Веб-сайт &ndash; совокупность графических и информационных материалов, а также программ для ЭВМ и
              баз данных, обеспечивающих их доступность в сети Интернет по сетевому адресу https://oilama.com;</p>

            <p>2.4. Информационная система персональных данных &mdash; совокупность содержащихся в базах данных
              персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;</p>

            <p>2.5. Обезличивание персональных данных &mdash; действия, в результате которых невозможно определить без
              использования дополнительной информации принадлежность персональных данных конкретному Пользователю или
              иному субъекту персональных данных;</p>

            <p>2.6. Обработка персональных данных &ndash; любое действие (операция) или совокупность действий
              (операций), совершаемых с использованием средств автоматизации или без использования таких средств с
              персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление,
              изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание,
              блокирование, удаление, уничтожение персональных данных;</p>

            <p>2.7. Оператор &ndash; юридическое лицо, самостоятельно или совместно с другими лицами организующие и
              (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных
              данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными
              данными;</p>

            <p>2.8. Персональные данные &ndash; любая информация, относящаяся прямо или косвенно к определенному или
              определяемому Пользователю веб-сайта https://oilama.com;</p>

            <p>2.9. Пользователь &ndash; любой посетитель веб-сайта https://oilama.com;</p>

            <p>2.10. Предоставление персональных данных &ndash; действия, направленные на раскрытие персональных данных
              определенному лицу или определенному кругу лиц;</p>

            <p>2.11. Распространение персональных данных &ndash; любые действия, направленные на раскрытие персональных
              данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными
              данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой
              информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к
              персональным данным каким-либо иным способом;</p>

            <p>2.12. Трансграничная передача персональных данных &ndash; передача персональных данных на территорию
              иностранного государства органу власти иностранного государства, иностранному физическому или иностранному
              юридическому лицу;</p>

            <p>2.13. Уничтожение персональных данных &ndash; любые действия, в результате которых персональные данные
              уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в
              информационной системе персональных данных и (или) уничтожаются материальные носители персональных
              данных.</p>

            <p>2.14. Биометрические персональные данные &ndash; персональные данные, которые характеризуют
              физиологические и биологические особенности субъекта персональных данных, на основе которых можно
              установить его личность.</p>

            <p>&nbsp;</p>

            <p>3. Принципы и условия обработки персональных данных</p>

            <p>3.1. При обработке персональных данных Оператор придерживается следующих принципов:</p>

            <p>3.1.1. Обработка персональных данных осуществляется на законной и справедливой основе.</p>

            <p>3.1.2. Персональные данные не раскрываются третьим лицам и не распространяются без согласия субъекта
              персональных данных, за исключением случаев, предусмотренных действующим законодательством Республики
              Казахстан.</p>

            <p>3.1.3. Определение конкретных законных целей до начала обработки (в т.ч. сбора) персональных данных.</p>

            <p>3.1.4. Ведется сбор только тех персональных данных, которые являются необходимыми и достаточными для
              Оператора.</p>

            <p>3.1.5. Объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях,
              несовместимых между собой не допускается.</p>

            <p>3.1.6. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и
              законных целей.</p>

            <p>3.1.7. При обработке персональных данных должны быть обеспечены точность персональных данных, их
              достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных.
              Оператор должен принимать необходимые меры либо обеспечивать их принятие по удалению или уточнению
              неполных, или неточных персональных данных.</p>

            <p>3.1.8. Обрабатываемые персональные данные подлежат уничтожению или обезличиванию по достижению целей
              обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено
              действующим законодательством Республики Казахстан.</p>

            <p>3.2. Оператор не осуществляет обработку персональных данных, касающихся расовой, национальной
              принадлежности, политических взглядов, религиозных, философских и иных убеждений, интимной жизни, членства
              в общественных объединениях, в том числе в профессиональных союзах.</p>

            <p>&nbsp;</p>

            <p>4.Оператор может обрабатывать следующие персональные данные Пользователя</p>

            <p>4.1. Фамилия, имя, отчество;</p>

            <p>4.2. Электронный адрес;</p>

            <p>4.3. Номера телефонов;</p>

            <p>4.4. Год, месяц, дата и место рождения;</p>

            <p>4.5. Фотографии;</p>

            <p>4.6. Также на сайте происходит сбор и обработка обезличенных данных о Посетителях с помощью сервисов
              Интернет-статистики.</p>

            <p>4.7. В случае если Пользователь является автором или правообладателем, размещающим Онлайн-курс на
              Веб-сайте:</p>

            <p>&ndash; Адрес местонахождения;</p>

            <p>&ndash; Данные документов, удостоверяющих личность;</p>

            <p>&ndash; Банковские реквизиты.</p>
            <p>4.8. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.</p>
            <p>&nbsp;</p>
            <p>5. Цели обработки персональных данных</p>
            <p>5.1. Цель обработки персональных данных Пользователя &mdash; предоставление доступа Пользователю к
              сервисам, информации и/или материалам, содержащимся на веб-сайте.</p>
            <p>5.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах,
              специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения
              информационных сообщений, направив Оператору письмо на адрес электронной почты manager@oilama.com с
              пометкой &laquo;Отказ от уведомлений о новых продуктах и услугах и специальных предложениях&raquo;.</p>
            <p>5.3. Обезличенные данные Пользователей, собираемые с помощью сервисов Интернет-статистики, служат для
              сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.</p>
            <p>6. Правовые основания обработки персональных данных</p>
            <p>6.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки
              Пользователем самостоятельно через специальные формы, расположенные на сайте https://oilama.com. Заполняя
              соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое
              согласие с данной Политикой.</p>
            <p>6.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках
              браузера Пользователя.</p>
            <p>&nbsp;</p>
            <p>7. Порядок сбора, хранения, передачи и других видов обработки персональных данных</p>
            <p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации
              правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований
              действующего законодательства в области защиты персональных данных.</p>
            <p>7.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие
              доступ к персональным данным неуполномоченных лиц.</p>
            <p>7.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за
              исключением случаев, связанных с исполнением действующего законодательства Республики Казахстан.</p>
            <p>7.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их
              самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора
              manager@oilama.com с пометкой &laquo;Актуализация персональных данных&raquo;.</p>
            <p>7.4. Срок обработки персональных данных является неограниченным. Пользователь может в любой момент
              отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством
              электронной почты на электронный адрес Оператора manager@oilama.com с пометкой &laquo;Отзыв согласия на
              обработку персональных данных&raquo;.</p>
            <p>&nbsp;</p>
            <p>8. Трансграничная передача персональных данных</p>
            <p>8.1. Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том,
              что иностранным государством, на территорию которого предполагается осуществлять передачу персональных
              данных, обеспечивается надежная защита прав субъектов персональных данных.</p>
            <p>8.2. Трансграничная передача персональных данных на территории иностранных государств, не отвечающих
              вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме
              субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения Договора,
              Стороной которого является субъект персональных данных.</p>
            <p>&nbsp;</p>
            <p>9. Заключительные положения</p>
            <p>9.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его
              персональных данных, обратившись к Оператору с помощью электронной почты manager@oilama.com.</p>
            <p>9.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором.
              Политика действует бессрочно до замены ее новой версией.</p>
            <p>9.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу <a
              href="https://oilama.com"
            >https://oilama.com</a>.</p>
          </div>
          <div class="terms_block_content" v-if="term==5">
            <h5>Политика защиты интеллектуальной собственности</h5>
            Oilama.com – образовательный маркетплейс (Далее - Платформа), предоставляющий доступ к образовательным
            материалам (Далее - Курсы) в самых разных сферах. Авторы курсов могут размещать свои платные, либо
            бесплатные курсы, определять стоимость, редактировать и дополнять. Ученики в свою очередь, приобретают
            Курсы, проходят обучение и получают сертификат.
            В целях обеспечения прозрачной работы , а также безопасности всех сторон сотрудничества в рамках нашей
            платформы, мы разработали данное Пользовательское соглашение (Далее - Соглашение). Здесь мы подробно
            пропишем правила и условия использования Платформы, как работает экосистема Oilama.
            Данное Соглашение работает совместно с другими нормативными актами: Условия для преподавателей, Безопасность
            онлайн платежей, Политика конфиденциальности и Политика защиты интеллектуальной собственности. Все эти
            документы находятся в открытом доступе на сайте Oilama.com
            Для получения пользы от нашей платформы, необходимо зарегистрировать учетную запись. Вы должны понимать, что
            несете ответственность за все действия, связанные с Вашей учетной записью. Вы должны понимать, что
            оскорбление личности даже в онлайн среде карается по закону в большинстве стран мира, также Вы должны
            достигать допустимого для использования онлайн-сервисов возраста, который регламентирован в Вашей стране.
            В случае, если Вы заметили активность, которую Вы не совершали, либо Вы подозревает что кто-то использует
            Вашу учетную запись, сообщите нам об этом написав в Службу поддержки, либо на почту manager@oilama.com
            Для предотвращения таких событий, советуем Вам бережно относиться с Вашим паролем.
            Если Вы свяжетесь с нами, чтобы запросить доступ к учетной записи, мы предоставим вам такой доступ, только
            если Вы предоставите нам информацию, необходимую для подтверждения права Вашего владения учетной записью. В
            случае смерти пользователя его учетная запись будет закрыта.
            Вы не можете предоставлять доступ к Вашей учетной записи третьим лицам. Если мы заметим, что Вы нарушаете
            какое-либо из правил настоящего Соглашения, мы будем вынуждены удалить Вашу учетную запись.
            При приобретении Курса, Вы получаете право на просмотр и обучение с пожизненным доступом, без права записи
            материалов, продажи или передачи учетной записи, за исключением случаев, когда мы вынуждены удалить
            материалы.
            В случае, если приобретенный Вами курс пропал из списка доступных к обучению курсов в Вашей учетной записи,
            Вы можете обратиться в Службу поддержки.
            В случае, если приобретенный Вами курс не соответствует заявленному описанию, либо по другой мотивированной
            причине, Вы можете отказаться от прохождения курса в течении 14 дней с момента приобретения, при условии что
            Вы прошли не более половины недель (уроков). Возврат средств может занимать до 3-х месяцев с момента подачи
            заявки на возврат. Для этого Вам нужно написать в Службу поддержки, либо на почту manager@oilama.com
            Цены на Курсы на нашей платформе устанавливаются авторами, могут изменяться в зависимости от различных
            факторов и анализа автора. Также на нашей платформе проводятся акции, скидки и другие действия, влияющие на
            цены. Цена на платформе может отличаться от цены, которую Вы увидели в сторонних ресурсах, рекламирующих
            Курс.
            В некоторых случаях, команда нашей платформы привлекает третьих лиц для оказания услуг. Также мы имеем право
            размещать информацию, находящуюся на нашей платформе на сторонних ресурсах, в целях рекламы или продвижения.
            Все эти действия осуществляются исключительно в целях всеобщей выгоды.
            Мы оставляем за собой право отказать в регистрации на нашей платформе в одностороннем порядке, без
            разъяснения причин.
            В случае, если Вы осуществите любое из указанных ниже действий, будет означать что Вы принимаете настоящее
            Соглашение и обязуетесь выполнять все правила:
            – осуществление доступа к размещенным на Сайте Oilama.com (Далее - Сайт) информации и материалам, независимо
            от продолжительности такого доступа и количества просмотренных страниц Сайта;
            – регистрация на Сайте;
            – оплата материалов Сайта, предоставляемых на возмездной основе;
            – иные действия по использованию сервисов Сайта.
            Данное Соглашение написано на русском языке, в случае перевода на другие языки, во всех случаях, с точки
            зрения закона, либо в суде будет рассматриваться вариант Соглашения на русском языке. Мы оставляем за собой
            право вносить поправки, изменения в Соглашение в одностороннем порядке, с указанием даты последней редакции
            и измененных пунктов.
            "PayDay Service" LLC
            БИН: 200240010312
            010000, г. Нур-Султан
            Улы-Дала 27/1


          </div>

        </div>

      </div>

    </div>
  </div>
</template>

<script>

export default {
  name: 'about',
  layout: 'main',
  components: {},
  data () {
    return {
      term: 1,
    }
  },
  created () {
    this.getCategories()
    this.getNews()
  },
  methods: {
    getNews () {
      this.$axios
        .get(`/news-categories`, {
          headers: {
            Authorization: process.env.defaultToken
          }
        })
        .then((response) => {
          this.categories = response.data.data.categories
        })
    },
    getCategories () {

    }
  },
  computed: {},
}
</script>

<style scoped lang="scss">
.terms {
  padding-top: 70px;
  padding-bottom: 100px;
  position: relative;

  &_block {
    display: grid;
    grid-template-columns: 25% 75%;
    grid-gap: 30px;

    &_content {
      background: #FFFFFF;
      box-shadow: 0px 16px 51px rgba(0, 0, 0, 0.12);
      border-radius: 13px;
      font-style: normal;
      font-weight: 300;
      font-size: 16px;
      line-height: 24px;
      color: #000000;

      padding: 30px;

      h5 {
        font-style: normal;
        font-weight: 500;
        font-size: 18px;
        line-height: 24px;
        color: #000000;
        margin-bottom: 40px;
      }
    }

    &_menu {
      &_item {
        font-style: normal;
        font-weight: 500;
        font-size: 18px;
        line-height: 22px;
        color: #000000;
        margin-bottom: 15px;
        background: #FFFFFF;
        box-shadow: 0px 16px 51px rgba(0, 0, 0, 0.12);
        border-radius: 13px;
        padding: 20px;

        &.active {

          color: #FFFFFF;
          background: linear-gradient(136.1deg, #FF4E50 24.18%, #1A116F 173.45%);
          border-radius: 13px;
        }

      }
    }

    &_image {
      img {
        width: 100%;
      }
    }

    &_content {
      p {
        font-style: normal;
        font-weight: 300;
        font-size: 18px;
        line-height: 24px;
        color: #000000;
      }
    }
  }

  ._title {
    display: block;
    margin-top: 45px;

    p {
      font-style: normal;
      font-weight: 500;
      font-size: 24px;
      color: #0B132A;
      margin-bottom: 25px;
      margin-top: 45px;
    }
  }
}

@media screen and (max-width: 550px) {
  .about {
    padding-top: 140px;
  }
  .about_block {
    display: block;
  }
  .course ._list {
    grid-template-columns: 1fr 1fr;
  }
  .about_left_absolute {
    display: none;
  }
  .about_right_absolute {
    display: none;
  }
  .terms {
    margin-top: 70px;

    &_block {
      display: block;
    }
  }
}
</style>
